let noiseData = [
  {
    area: "阳光帝景",
    timeData: [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],
    valueData: [21,24,25,24,22,21,18,19,15,15,15,20,22,24,22,21,17,15,14,14,10,3,2,1]
  },{
    area: "江北顶山街道",
    timeData: [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],
    valueData: [21,22,23,24,22,21,18,19,15,15,21,24,25,24,22,21,10,10,5,5,2,15,13,23]
  },{
    area: "大新华府南区",
    timeData: [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],
    valueData: [15,20,22,24,22,21,17,15,14,14,21,22,23,24,22,21,18,19,15,15,8,2,9,1]
  },{
    area: "大新华府北区",
    timeData: [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24],
    valueData: [21,24,25,24,22,21,10,10,5,5,21,24,25,24,22,21,18,19,15,15,10,2,3,1]
  }
]

let noiseTrace = {
  "大新华府北区": null,
  "大新华府南区": null,
  "江北顶山街道": null,
  "阳光帝景": null,
  "噪音溯源坐标": null
}

fetch("http://120.55.86.4:8085/sourcenoise")
.then(res=>res.json())
.then(res=>{
  noiseTrace["大新华府北区"] = res.data[0]
  noiseTrace["大新华府南区"] = res.data[1]
  noiseTrace["江北顶山街道"] = res.data[2]
  noiseTrace["阳光帝景"] = res.data[3]
  noiseTrace["噪音溯源坐标"] = [ res.data[5],res.data[4] ]
})

export {noiseTrace}